Merge pull request #9 from Khr29/feature/pharmacy
Feature/pharmacy
